 Библиотека иска да се организира информацията за книгите които притежава в информационната система.
 за всяка книга тя събира следните данни: име, автор, жанр, и година на издаване.
 За авторите се съхранява нформация за име, фамилия и националност.
 жанровете са: класика, детски, фантастика, биографичен, любовен.
 
 реализирайте добавяне на нова книга.
 реализирайте операцията обавяне на книга.
 
 реализирайте търсене на книга  по име или част от мето. //.find в стринг
 въвеждайте параметрите на търсенето чрез стандартен вход.
 покажете резулататите.
 
 - Реализирайте търсене на книга по автор, Покажете резултатите.
 
 За съхраняване на информацията използвайте файлове и сериализция.